reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
// ===========================================================================
//  Athena Rover 2026 — Firmware ESP32-S3 AUTÓNOMO (sin Raspberry Pi)
//  Retos del Rover H07 · INTEC · Reymildo & Montse
// ===========================================================================
//
//  Variante de firmware-esp32/src/main.cpp para la DEMOSTRACIÓN: aquí la
//  misión completa (percibir -> decidir -> mover) corre DENTRO del ESP32-S3,
//  en su propia tarea de FreeRTOS (MissionTask). No hay enlace serial con
//  ninguna computadora ni cámara: el robot arranca, hace su ronda solo, y se
//  detiene. Cada subsistema de hardware sigue en su propia tarea, igual que
//  en la versión con Raspberry Pi, comunicadas SOLO por colas explícitas.
//
//  QUÉ SE PUEDE HACER SIN RASPBERRY PI Y QUÉ NO
//  ----------------------------------------------------------------------
//  El ESP32-S3 por sí solo NO tiene cámara: no puede reconocer la forma ni
//  el color de un objeto lejano, solo leer sensores de contacto/proximidad
//  y el color del piso justo debajo de sí. Con eso alcanza para:
//    ✔ Identificar las líneas/zonas de piso negro, amarillo, rojo y azul
//      (TCS34725 trasero, igual que la versión con Raspberry Pi).
//    ✔ Cargar y depositar la llave: se asume que un operador la coloca a
//      mano en la pinza abierta antes de encender el robot (igual que
//      asume raspberry-pi/src/athena/decision.py en su fase INICIO) — el
//      firmware la sujeta, la transporta a la zona amarilla y la suelta.
//    ✘ Buscar y agarrar la bandera del equipo contrario. Sin cámara ni
//      telémetro (el VL53L1X y el TCS34725 delantero, ambos en el bus I2C
//      nº0, se retiraron de esta variante — daban problemas físicos
//      persistentes en banco) no queda ningún sensor capaz de detectar
//      "hay algo delante": esta demo se limita a depositar la llave y
//      termina ahí. Para la misión completa (agarrar y devolver la
//      bandera) hace falta la cámara + Edge Impulse de
//      raspberry-pi/src/athena/ei_flag_detector.py (ver firmware-esp32/).
//
//  LED RGB: INDICADOR PURO DE LA LÍNEA/ZONA DE PISO, nada más
//  ----------------------------------------------------------------------
//    · Piso gris (zona neutra) o sin lectura válida -> APAGADO.
//    · Amarillo / rojo / azul -> ese mismo color, fijo, mientras el sensor
//      trasero esté sobre esa zona.
//    · Negro (borde) -> destello alternando rojo/azul, como alerta.
//  El LED YA NO indica equipo ni "veo la bandera": esta variante lo dedica
//  por completo a decir en qué línea está parado el robot.
//
//  SWITCH DE EQUIPO: sin Raspberry Pi que le diga "--equipo rojo/azul" por
//  línea de comandos, el equipo se elige con un switch físico de 3
//  posiciones (ON-OFF-ON) en Pins::TEAM_SWITCH_BLUE/RED (ver más abajo).
//  A diferencia del viejo puente de un solo pin, setup() se QUEDA ESPERANDO
//  en la posición central (0, nadie ha elegido) antes de arrancar
//  MissionTask — el procedimiento normal es encender el robot con el switch
//  en 0 y recién ahí elegir equipo, sin que el robot se mueva mientras tanto.
//
//  HARDWARE (idéntico a firmware-esp32/, más el switch de equipo, MENOS el
//  bus I2C nº0 -- ver más abajo por qué se retiró por completo):
//    · 2x L298N            -> 4 motores (cada driver mueve 2)
//    · 1x PCA9685 (I2C)    -> 1 servo del gripper (la pinza que abre/cierra)
//    · 1x TCS34725 (I2C)   -> sensor de color trasero (único que queda)
//    · 2x QTRX-HD-01A      -> reflectancia delantera izquierda y derecha
//    · LED RGB (1x)        -> indicador puro de la línea/zona de piso
//    · Switch 3 posiciones -> 0=nadie ha elegido, 1=azul, 2=rojo
//
//  BUS I2C Nº0 RETIRADO POR COMPLETO (TCS34725 delantero + VL53L1X)
//  ----------------------------------------------------------------------
//  El sensor de color delantero nunca dio una conexión física confiable en
//  banco (SDA/SCL intermitentes, ver el historial en calibracion/color/), y
//  el VL53L1X dependía de compartir bus con él (mismo 0x29 de fábrica,
//  coreografía de XSHUT). Decisión del equipo: en vez de seguir
//  depurando un bus que solo daba problemas, se elimina TODO lo asociado a
//  él -- pines, mutex, tarea del ToF, lado delantero de ColorSensorTask --
//  y la misión se apoya solo en el TCS34725 trasero (bus nº1) y en tiempos
//  fijos donde antes hacía falta el ToF. Ver el índice: ya no hay sección
//  de ToF ni de sensor delantero.
//
//  ÍNDICE
//    [1] Configuración: pines, prioridades, stacks, periodos
//    [2] Tipos compartidos entre tareas
//    [3] Colas
//    [4] Watchdog cooperativo (heartbeats)
//    [5] Driver PCA9685 (servos por I2C)
//    [6] Driver TCS34725 (sensor de color trasero, por I2C)
//    [7] Clasificación de color -> etiqueta de zona
//    [8] Tareas de hardware (motores, gripper, color, reflectancia, LED)
//    [9] MissionTask — el cerebro: percibir -> decidir -> mover, sin RPi
//    [10] setup() / loop()
//
// ===========================================================================

#include <Arduino.h>
#include <Wire.h>
#include <freertos/semphr.h>   // SemaphoreHandle_t / mutex del bus I2C (ver g_i2c1Mutex)
#include <esp_system.h>        // esp_reset_reason() — ver el log de motivo de reinicio en setup()

// ===========================================================================
//  [1] CONFIGURACIÓN
// ===========================================================================
//
//  PINES PROHIBIDOS en el ESP32-S3 DevKitC-1 — respetarlos no es opcional:
//    GPIO 19, 20    -> USB nativo (D-/D+).
//    GPIO 43, 44    -> U0TXD/U0RXD, puerto de programación y depuración.
//    GPIO 26..32    -> flash SPI interna. Tocarlos cuelga el chip.
//    GPIO 33..37    -> PSRAM Octal (módulos N8R8/N16R8). Igual de intocables.
//    GPIO 0, 45, 46 -> pines de strapping: su nivel al arranque decide el modo
//                      de boot. Evitarlos.
//    GPIO 3         -> strapping de JTAG. Se puede usar, pero mejor no.
//
//  Además: los sensores analógicos DEBEN ir en ADC1 (GPIO 1..10). El ADC2
//  queda inutilizable en cuanto se enciende el WiFi.

namespace Pins {
    // -------- Motores: 2x L298N, cada uno mueve 2 motores ------------------
    constexpr uint8_t L298N_L_IN1 = 4;    // FL sentido A
    constexpr uint8_t L298N_L_IN2 = 5;    // FL sentido B
    constexpr uint8_t L298N_L_ENA = 6;    // FL velocidad (PWM)
    constexpr uint8_t L298N_L_IN3 = 7;    // RL sentido A
    constexpr uint8_t L298N_L_IN4 = 15;   // RL sentido B
    constexpr uint8_t L298N_L_ENB = 16;   // RL velocidad (PWM)

    constexpr uint8_t L298N_R_IN1 = 10;   // FR sentido A
    constexpr uint8_t L298N_R_IN2 = 11;   // FR sentido B
    constexpr uint8_t L298N_R_ENA = 12;   // FR velocidad (PWM)
    constexpr uint8_t L298N_R_IN3 = 13;   // RR sentido A
    constexpr uint8_t L298N_R_IN4 = 14;   // RR sentido B
    constexpr uint8_t L298N_R_ENB = 17;   // RR velocidad (PWM)

    // -------- Bus I2C nº1: TCS34725 TRASERO + PCA9685 (servos) --------------
    // El bus I2C nº0 (TCS34725 delantero + VL53L1X) se retiró por completo
    // -- ver la nota grande al principio del archivo. Este es ahora el
    // ÚNICO bus I2C del firmware: el TCS34725 trasero y el PCA9685
    // conviven aquí, protegidos por g_i2c1Mutex por el riesgo de
    // concurrencia entre tareas de distinto núcleo (GripperTask en el
    // núcleo 1, ColorSensorTask en el núcleo 0).
    constexpr uint8_t I2C1_SDA = 47;
    constexpr uint8_t I2C1_SCL = 48;

    // -------- Reflectancia QTRX-HD-01A (salida analógica) ------------------
    // ¡ALIMENTARLOS A 3.3 V! Ver la nota larga en ReflectanceTask.
    constexpr uint8_t QTR_LEFT_OUT  = 1;  // GPIO1 = ADC1_CH0
    constexpr uint8_t QTR_RIGHT_OUT = 2;  // GPIO2 = ADC1_CH1
    constexpr uint8_t QTR_EMITTER_CTRL = 42;

    // -------- LED RGB indicador de equipo / zona / bandera ------------------
    constexpr uint8_t LED_RGB_R = 39;
    constexpr uint8_t LED_RGB_G = 38;
    constexpr uint8_t LED_RGB_B = 41;

    // -------- Switch de 3 posiciones (ON-OFF-ON): selección de equipo ------
    // Reemplaza al viejo puente TEAM_SELECT de un solo pin (GND=ROJO,
    // abierto=AZUL, sin reposo real): ahora hay una posición central de
    // verdad (0 = nadie ha elegido todavía), igual que en firmware-esp32/.
    // El común del switch va a GND; cada tiro cierra a GND uno de estos 2
    // GPIO, leídos con pull-up interno (INPUT_PULLUP): HIGH = tiro abierto,
    // LOW = tiro cerrado. GPIO21 se liberó del LED trasero del TCS34725 (ver
    // arriba); GPIO40 es el mismo pin que ya usaba TEAM_SELECT.
    // Mismo cableado físico que firmware-esp32/ -- ver el comentario ahí:
    // el tiro "AZUL" quedó en GPIO 40 y el "ROJO" en GPIO 21, al revés del
    // borrador original de hardware/conexiones-esp32-s3.md.
    constexpr uint8_t TEAM_SWITCH_BLUE = 40;  // tiro "AZUL" cerrado a GND = equipo azul
    constexpr uint8_t TEAM_SWITCH_RED  = 21;  // tiro "ROJO" cerrado a GND = equipo rojo
}

