reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
namespace I2CAddr {
    constexpr uint8_t PCA9685  = 0x40;
    constexpr uint8_t TCS34725 = 0x29;
}

namespace ServoChannel {
    constexpr uint8_t CLAW = 0;   // abre/cierra la pinza
}

namespace Pwm {
    constexpr uint32_t MOTOR_FREQ_HZ    = 1000;
    constexpr uint8_t  MOTOR_RESOLUTION = 8;     // duty 0..255

    constexpr uint32_t RGB_FREQ_HZ    = 5000;
    constexpr uint8_t  RGB_RESOLUTION = 8;       // duty 0..255

    constexpr uint32_t SERVO_FREQ_HZ  = 50;
    constexpr uint16_t SERVO_TICK_MIN = 205;   // pulso 1.0 ms ->   0 grados
    constexpr uint16_t SERVO_TICK_MAX = 410;   // pulso 2.0 ms -> 180 grados
}

// Prioridades FreeRTOS (mayor número = mayor prioridad).
namespace TaskPriority {
    constexpr UBaseType_t SUPERVISOR      = 6;
    constexpr UBaseType_t MOTOR_CONTROL   = 5;
    constexpr UBaseType_t MISSION         = 4;  // el cerebro: no debe acumular retraso
    constexpr UBaseType_t GRIPPER_CONTROL = 3;
    constexpr UBaseType_t REFLECTANCE     = 3;
    constexpr UBaseType_t COLOR_SENSOR    = 2;
    constexpr UBaseType_t LED_STATUS      = 1;
}

namespace TaskStack {
    constexpr uint32_t SUPERVISOR      = 3072;
    constexpr uint32_t MISSION         = 4096;  // máquina de estados + logs
    constexpr uint32_t MOTOR_CONTROL   = 3072;
    constexpr uint32_t GRIPPER_CONTROL = 3072;
    constexpr uint32_t REFLECTANCE     = 2560;
    constexpr uint32_t COLOR_SENSOR    = 3584;
    constexpr uint32_t LED_STATUS      = 2048;
}

namespace TaskPeriodMs {
    constexpr uint32_t SUPERVISOR    = 200;
    constexpr uint32_t MISSION       = 50;   // 20 Hz, de sobra para decidir
    constexpr uint32_t MOTOR_CONTROL = 20;   // 50 Hz
    constexpr uint32_t GRIPPER       = 50;
    constexpr uint32_t REFLECTANCE   = 20;   // 50 Hz, seguimiento de línea
    constexpr uint32_t COLOR_SENSOR  = 100;  // 10 Hz
    constexpr uint32_t LED_STATUS    = 100;  // más rápido que antes: hace falta para el destello de 5 Hz
}

// Sin heartbeat por más de este tiempo, el supervisor da la tarea por colgada.
constexpr uint32_t WATCHDOG_TIMEOUT_MS = 1000;

// Si MotorTask pasa este tiempo sin un comando fresco de MissionTask, frena
// por su cuenta. Ya no protege contra "se cayó el enlace con la Raspberry
// Pi" (no existe): protege contra "MissionTask se colgó" — mismo mecanismo,
// mismo valor, otro origen del riesgo.
constexpr uint32_t MISSION_FAILSAFE_TIMEOUT_MS = 500;

enum class TaskId : uint8_t {
    MOTOR_CONTROL = 0,
    GRIPPER_CONTROL,
    COLOR_SENSOR,
    REFLECTANCE,
    LED_STATUS,
    MISSION,
    COUNT   // siempre el último
};

#define DEBUG_LINK Serial   // USB nativo: sin Raspberry Pi, no hace falta reservarlo aparte

// ===========================================================================
//  [2] TIPOS COMPARTIDOS ENTRE TAREAS
// ===========================================================================

enum class TeamColor     : uint8_t { NONE = 0, RED = 1, BLUE = 2 };
enum class MotorMode     : uint8_t { STOP = 0, DRIVE = 1 };
enum class GripperAction : uint8_t { OPEN = 0, CLOSE_LLAVE = 1, CLOSE_BANDERA = 2 };
enum class ColorLabel    : uint8_t { UNKNOWN = 0, BLACK, YELLOW, RED, BLUE, FLOOR };

struct MotorCommand {
    MotorMode mode = MotorMode::STOP;
    int8_t    left  = 0;   // -100..100 (%), lado izquierdo (FL+RL)
    int8_t    right = 0;   // -100..100 (%), lado derecho  (FR+RR)
};

struct GripperCommand {
    GripperAction action = GripperAction::OPEN;
};

// El LED aquí tiene un solo trabajo: decir sobre qué línea/zona está el
// robot AHORA MISMO. MissionTask ya tiene la lectura de color a mano (la
// necesita para decidir), así que se la pasa a LedTask en vez de que
// LedTask vuelva a suscribirse a colorQueue por su cuenta — una sola tarea
// consume cada cola.
struct LedCommand {
    ColorLabel zone = ColorLabel::UNKNOWN;
};

struct ColorReading {
    uint32_t   timestamp_ms = 0;
    ColorLabel back         = ColorLabel::UNKNOWN;
    bool       back_valid   = false;
};

struct ReflectanceReading {
    uint32_t timestamp_ms  = 0;
    uint16_t left_raw      = 0;
    uint16_t right_raw     = 0;
    bool     left_on_line  = false;
    bool     right_on_line = false;
};

struct HealthReport {
    uint32_t timestamp_ms          = 0;
    uint8_t  faulted_tasks_bitmask = 0;
};

// ===========================================================================
//  [3] COLAS
// ===========================================================================
//
//   MissionTask --> motorCmdQueue   (1, overwrite) --> MotorTask
//               --> gripperCmdQueue (4, FIFO)      --> GripperTask
//               --> ledCmdQueue     (1, overwrite) --> LedTask
//
//   ColorSensorTask --> colorQueue   (4, FIFO)      --> MissionTask
//   ReflectanceTask --> reflectQueue (4, FIFO)      --> MissionTask
//   SupervisorTask  --> healthQueue  (1, overwrite) --> MissionTask (solo log)
//
//  Mismo criterio que en firmware-esp32/: colas "overwrite" para datos donde
//  solo importa el valor más reciente, FIFO para eventos que hay que ver
//  todos y en orden. Ninguna tarea usa portMAX_DELAY: todo timeout 0.

static QueueHandle_t g_motorCmdQueue   = nullptr;
static QueueHandle_t g_gripperCmdQueue = nullptr;
static QueueHandle_t g_ledCmdQueue     = nullptr;
static QueueHandle_t g_colorQueue      = nullptr;
static QueueHandle_t g_reflectQueue    = nullptr;
static QueueHandle_t g_healthQueue     = nullptr;

// ---------------------------------------------------------------------------
//  Mutex del bus I2C nº1 (Wire1) — TCS34725 trasero + PCA9685 (servos).
// ---------------------------------------------------------------------------
//  Único bus I2C de este firmware: el bus nº0 (TCS34725 delantero + ToF) se
//  retiró por completo, ver la nota grande al principio del archivo.
//
//  GripperTask (el PCA9685) corre en el núcleo 1, ColorSensorTask (el
//  TCS34725 trasero) en el núcleo 0 — pueden estar ejecutando una
//  transacción I2C cada una AL MISMO TIEMPO sobre el mismo objeto `Wire1`,
//  y ninguna deshabilita el planificador durante beginTransmission()/
//  endTransmission(). Este mutex serializa toda transacción sobre el bus:
//  cada tarea lo toma antes de tocar `Wire1` y lo suelta apenas termina.
//
//  Con timeout corto (no portMAX_DELAY, por la misma regla que las colas):
//  si no se consigue el bus en I2C1_LOCK_TIMEOUT_MS, la operación se da por
//  fallida esta vuelta y se reintenta en la siguiente.
static SemaphoreHandle_t g_i2c1Mutex = nullptr;
constexpr uint32_t I2C1_LOCK_TIMEOUT_MS = 50;

static inline bool I2c1Lock() {
    return xSemaphoreTake(g_i2c1Mutex, pdMS_TO_TICKS(I2C1_LOCK_TIMEOUT_MS)) == pdTRUE;
}

static inline void I2c1Unlock() {
    xSemaphoreGive(g_i2c1Mutex);
}

