reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
    for (;;) {
        if (!pca_ok && (uint32_t)(millis() - last_retry_ms) > 1000) {
            last_retry_ms = millis();
            if (I2c1Lock()) {
                pca_ok = Pca9685::Init(Pwm::SERVO_FREQ_HZ);
                // Si el PCA9685 no respondió al arrancar (arriba se saltó el
                // SetChannel inicial) y recién ahora reaparece, hay que
                // mandar la pinza a 0° aquí también — si no, se queda
                // esperando un GripperCommand que puede no llegar nunca (por
                // ejemplo, con Mission::kMotionEnabled en false, que no
                // manda ninguno).
                if (pca_ok) {
                    pca_ok = Pca9685::SetChannel(ServoChannel::CLAW, ServoAngleToTicks(kClawOpenDeg));
                }
                I2c1Unlock();
            }
        }

        GripperCommand cmd;
        if (xQueueReceive(g_gripperCmdQueue, &cmd, 0) == pdTRUE && pca_ok) {
            if (I2c1Lock()) {
                switch (cmd.action) {
                    case GripperAction::OPEN:
                        pca_ok = Pca9685::SetChannel(ServoChannel::CLAW, ServoAngleToTicks(kClawOpenDeg));
                        break;
                    case GripperAction::CLOSE_LLAVE:
                        pca_ok = Pca9685::SetChannel(ServoChannel::CLAW, ServoAngleToTicks(kClawClosedLlaveDeg));
                        break;
                    case GripperAction::CLOSE_BANDERA:
                        pca_ok = Pca9685::SetChannel(ServoChannel::CLAW, ServoAngleToTicks(kClawClosedBanderaDeg));
                        break;
                    default:
                        break;   // acción desconocida: se ignora
                }
                I2c1Unlock();
            }
        }

        Heartbeat(TaskId::GRIPPER_CONTROL);
        vTaskDelayUntil(&last_wake, period);
    }
}

template <typename T>
void PushDropOldest(QueueHandle_t queue, const T &item) {
    if (xQueueSend(queue, &item, 0) != pdTRUE) {
        T discard;
        xQueueReceive(queue, &discard, 0);
        xQueueSend(queue, &item, 0);
    }
}

// ---------------------------------------------------------------------------
//  8.3  ColorSensorTask — TCS34725 trasero (Wire1), único sensor de color
// ---------------------------------------------------------------------------

void ColorSensorTask(void *) {
    // Único sensor y único bus desde que se retiró el bus I2C nº0 (ver la
    // nota grande al principio del archivo): sus llamadas van protegidas
    // por g_i2c1Mutex, que comparte con el PCA9685 (GripperTask corre en el
    // otro núcleo).
    bool back_ok = false;
    if (I2c1Lock()) {
        back_ok = Tcs34725::Init(Wire1);
        I2c1Unlock();
    }

    if (!back_ok) DEBUG_LINK.println("[Color] sensor TRASERO no responde (bus I2C 1).");

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::COLOR_SENSOR);
    TickType_t last_wake = xTaskGetTickCount();
    uint32_t last_retry_ms = millis();

    for (;;) {
        if (!back_ok && (uint32_t)(millis() - last_retry_ms) > 1000) {
            last_retry_ms = millis();
            if (I2c1Lock()) {
                back_ok = Tcs34725::Init(Wire1);
                I2c1Unlock();
            }
        }

        ColorReading reading;
        reading.timestamp_ms = millis();

        Tcs34725::Rgbc sample;
        if (back_ok) {
            bool read_ok = false;
            if (I2c1Lock()) {
                read_ok = Tcs34725::Read(Wire1, sample);
                I2c1Unlock();
            }
            if (read_ok) {
                reading.back = ClassifyColor(sample);
                reading.back_valid = true;
            } else {
                back_ok = false;
            }
        }

        PushDropOldest(g_colorQueue, reading);

        Heartbeat(TaskId::COLOR_SENSOR);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.4  ReflectanceTask — 2x QTRX-HD-01A
// ---------------------------------------------------------------------------
//  Valor ADC ALTO = superficie OSCURA (cinta negra del borde). Ver la nota
//  larga en firmware-esp32/src/main.cpp si esto no es intuitivo.

constexpr uint16_t kDarkThreshold = 2048;   // TODO: calibrar en la pista real

void ReflectanceTask(void *) {
    analogReadResolution(12);
    analogSetPinAttenuation(Pins::QTR_LEFT_OUT, ADC_11db);
    analogSetPinAttenuation(Pins::QTR_RIGHT_OUT, ADC_11db);

    pinMode(Pins::QTR_EMITTER_CTRL, OUTPUT);
    digitalWrite(Pins::QTR_EMITTER_CTRL, HIGH);

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::REFLECTANCE);
    TickType_t last_wake = xTaskGetTickCount();

    for (;;) {
        ReflectanceReading reading;
        reading.timestamp_ms  = millis();
        reading.left_raw      = (uint16_t)analogRead(Pins::QTR_LEFT_OUT);
        reading.right_raw     = (uint16_t)analogRead(Pins::QTR_RIGHT_OUT);
        reading.left_on_line  = reading.left_raw  > kDarkThreshold;
        reading.right_on_line = reading.right_raw > kDarkThreshold;

        PushDropOldest(g_reflectQueue, reading);

        Heartbeat(TaskId::REFLECTANCE);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.5  LedTask — LED RGB: indicador puro de la línea/zona de piso
// ---------------------------------------------------------------------------
//  Único trabajo del LED en esta variante: decir sobre qué está parado el
//  robot AHORA MISMO, nada más — ni equipo, ni "veo la bandera".
//    · Piso gris (FLOOR) o sin lectura válida -> apagado.
//    · Amarillo / rojo / azul                 -> ese mismo color, fijo.
//    · Negro (borde)                          -> morado, fijo.

namespace RgbLed {
    constexpr uint8_t CH_R = 4;
    constexpr uint8_t CH_G = 5;
    constexpr uint8_t CH_B = 6;

    // POLARIDAD CONFIRMADA con el LED físico: es CÁTODO COMÚN, o sea duty
    // alto = canal más brillante (mismo caso que firmware-esp32/). La
    // constante se conserva por si algún día se cambia el LED por uno de
    // ánodo común.
    constexpr bool kCommonAnode = false;

    void Setup() {
        PwmAttach(Pins::LED_RGB_R, CH_R, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
        PwmAttach(Pins::LED_RGB_G, CH_G, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
        PwmAttach(Pins::LED_RGB_B, CH_B, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
    }

    void SetRaw(uint8_t r, uint8_t g, uint8_t b) {
        if (kCommonAnode) { r = 255 - r; g = 255 - g; b = 255 - b; }
        PwmWrite(Pins::LED_RGB_R, CH_R, r);
        PwmWrite(Pins::LED_RGB_G, CH_G, g);
        PwmWrite(Pins::LED_RGB_B, CH_B, b);
    }

    // Color fijo de cada zona -- BLACK incluido, ya no parpadea.
    void ApplyZone(ColorLabel zone) {
        switch (zone) {
            case ColorLabel::YELLOW: SetRaw(255, 170, 0); break;
            case ColorLabel::RED:    SetRaw(255, 0, 0);   break;
            case ColorLabel::BLUE:   SetRaw(0, 0, 255);   break;
            case ColorLabel::BLACK:  SetRaw(160, 0, 200); break;   // morado
            case ColorLabel::FLOOR:
            case ColorLabel::UNKNOWN:
            default:
                SetRaw(0, 0, 0);   // apagado: piso neutro o sin lectura
                break;
        }
    }
}

void LedTask(void *) {
    RgbLed::Setup();
    RgbLed::SetRaw(0, 0, 0);

