reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
    ColorLabel zone = ColorLabel::UNKNOWN;

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::LED_STATUS);
    TickType_t last_wake = xTaskGetTickCount();

    for (;;) {
        LedCommand cmd;
        if (xQueueReceive(g_ledCmdQueue, &cmd, 0) == pdTRUE) {
            zone = cmd.zone;
        }

        RgbLed::ApplyZone(zone);

        Heartbeat(TaskId::LED_STATUS);
        vTaskDelayUntil(&last_wake, period);
    }
}

} // namespace anónimo (tareas de hardware)

// ===========================================================================
//  [9] MISSIONTASK — el cerebro, sin Raspberry Pi
// ===========================================================================
//
//  Puerto parcial de la lógica de raspberry-pi/src/athena/decision.py a
//  C++: solo la parte de "cargar y depositar la llave". Esta variante NO
//  intenta buscar ni agarrar la bandera del oponente — ver el aviso grande
//  al principio del archivo sobre por qué (se retiró el bus I2C nº0, único
//  sensor con el que esta demo podía intentarlo). La prioridad de no
//  salirse de la pista sí es EXACTAMENTE la misma que allá: salirse de la
//  pista pierde la ronda de inmediato, así que esa regla no puede depender
//  de que nada más ande bien.

namespace Mission {

// Interruptor de emergencia: en false, MissionTask NO mueve motores ni el
// gripper — solo lee los sensores y deja que el LED (LedTask) siga mostrando
// la zona de piso. Sirve para probar sensores en el banco, o para desactivar
// el robot sin desconectarle nada.
//
// Estuvo en false durante unas pruebas en las que el robot se reiniciaba
// solo. La causa resultó ser un problema de CONEXIÓN, no de batería baja
// como se sospechó al principio, así que ya no hay motivo para dejarlo
// apagado: la misión completa está habilitada.
constexpr bool kMotionEnabled = true;

// Velocidades y umbrales — mismo rol que ControlConfig en decision.py,
// pero constexpr porque aquí no hay archivo de configuración que cargar.
constexpr int kVelocidadCrucero     = 70;   // % de PWM al avanzar recto
constexpr int kVelocidadAproximacion = 60;  // % al acercarse / evadir

constexpr uint32_t kStartupDelayMs   = 3000;  // tiempo para cargar la llave y ubicar el robot
constexpr uint32_t kGripperSettleMs  = 400;   // tiempo mecánico para que el servo llegue
// Full stop al llegar a la zona amarilla, antes de retroceder: pedido
// explícito para que el robot se detenga por completo (no una frenada
// suave a mitad de un SetDrive) antes de invertir el sentido de marcha.
constexpr uint32_t kFullStopMs       = 400;
// Retrocede a tiempo fijo justo DESPUÉS de que el sensor trasero detecta la
// zona amarilla, para que el frente (y la llave) quede dentro de la zona
// segura y no más allá de ella. Variable fácil de ajustar: solo este
// número, en milisegundos.
constexpr uint32_t kRetrocesoZonaNeutraMs = 3000;

enum class Phase : uint8_t {
    ARRANQUE = 0,
    ASEGURAR_LLAVE,
    BUSCAR_ZONA_NEUTRA,
    // Full stop al detectar la zona amarilla, antes de retroceder -- ver
    // kFullStopMs.
    DETENER_ZONA_NEUTRA,
    // Retrocede a tiempo fijo tras detectar la zona amarilla: el sensor
    // TRASERO ya la pasó de largo en el instante en que la detecta, así
    // que sin este paso el frente (y la llave) quedarían más allá de la
    // zona segura, no dentro.
    RETROCEDER_A_ZONA_NEUTRA,
    DEPOSITAR_LLAVE,
    TERMINADO,
};

// Nombre legible de cada fase, para el log — sin esto, el monitor serial
// solo mostraba el número crudo del enum y había que contar a mano.
inline const char *PhaseName(Phase phase) {
    switch (phase) {
        case Phase::ARRANQUE:            return "ARRANQUE";
        case Phase::ASEGURAR_LLAVE:      return "ASEGURAR_LLAVE";
        case Phase::BUSCAR_ZONA_NEUTRA:  return "BUSCAR_ZONA_NEUTRA";
        case Phase::DETENER_ZONA_NEUTRA: return "DETENER_ZONA_NEUTRA";
        case Phase::RETROCEDER_A_ZONA_NEUTRA: return "RETROCEDER_A_ZONA_NEUTRA";
        case Phase::DEPOSITAR_LLAVE:     return "DEPOSITAR_LLAVE";
        case Phase::TERMINADO:           return "TERMINADO";
        default:                         return "DESCONOCIDA";
    }
}

} // namespace Mission

// Evita depender de que el compilador trate a MotorCommand como agregado
// con inicializadores por defecto (necesita C++14+); igual que hace
// firmware-esp32/src/main.cpp, se asigna campo a campo.
inline void SetDrive(MotorCommand &m, int left, int right) {
    m.mode  = MotorMode::DRIVE;
    m.left  = (int8_t)constrain(left, -100, 100);
    m.right = (int8_t)constrain(right, -100, 100);
}

void MissionTask(void *pvTeam) {
    const TeamColor team = *reinterpret_cast<TeamColor *>(pvTeam);

    Mission::Phase phase = Mission::Phase::ARRANQUE;
    Mission::Phase last_logged_phase = phase;
    uint32_t phase_started_ms = millis();

    ColorReading       last_color{};
    ReflectanceReading last_reflect{};
    // Cerrojo: en cuanto el sensor trasero ve amarillo UNA vez estando en
    // BUSCAR_ZONA_NEUTRA, esto pasa a true y ya NUNCA vuelve a false --
    // pedido explícito: "que se detenga por completo al detectar la zona,
    // sin importar si luego empezaste a leer otra cosa" (ej. por inercia
    // el robot sigue deslizándose un poco y el sensor deja de ver amarillo
    // un instante después). Una vez puesto, también apaga la evasión de
    // borde (ver puede_evadir más abajo): el resto de la secuencia
    // (parada, retroceso, soltar la llave) es una maniobra fija que no
    // debe abortarse por una lectura de reflectancia.
    bool zona_neutra_detectada = false;

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::MISSION);
    TickType_t last_wake = xTaskGetTickCount();

    DEBUG_LINK.printf("[Mission] equipo = %s\n", team == TeamColor::RED ? "ROJO" : "AZUL");

    for (;;) {
        // --- 0. Refrescar la última lectura de cada sensor -----------------
        // Igual que hacía run_rover.py: se drena toda la cola y solo importa
        // el dato más reciente de cada tipo.
        ColorReading c;
        while (xQueueReceive(g_colorQueue, &c, 0) == pdTRUE) last_color = c;
        ReflectanceReading r;
        while (xQueueReceive(g_reflectQueue, &r, 0) == pdTRUE) last_reflect = r;
        HealthReport h;
        while (xQueueReceive(g_healthQueue, &h, 0) == pdTRUE) {
            DEBUG_LINK.printf("[Mission] tareas colgadas, bitmask=0x%02X\n", h.faulted_tasks_bitmask);
        }

        MotorCommand motor;               // por defecto: STOP
        GripperCommand gripper;
        bool send_gripper = false;

