reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
        // Interruptor de batería baja (Mission::kMotionEnabled): si está en
        // false, todo lo de aquí abajo se salta por completo. motor se queda
        // en su valor por defecto (STOP) y gripper nunca se envía — el
        // robot no mueve nada, solo sigue leyendo sensores y mostrando la
        // zona por el LED (eso pasa siempre, fuera de este bloque).
        if (Mission::kMotionEnabled) {

        // --- 0b. Cerrojo de zona neutra: detenerse YA, para siempre -------
        // Se evalúa ANTES que la evasión de borde a propósito: si se
        // dejara adentro del "if (puede_evadir)" de más abajo, una lectura
        // de reflectancia que diera evadiendo=true en el mismo instante
        // taparía esta detección (evadiendo=true se salta todo el
        // switch(phase), incluida la transición a DETENER_ZONA_NEUTRA) y
        // el robot seguiría de largo. Aquí no hay ese riesgo: en cuanto
        // ve amarillo una vez, cambia de fase inmediatamente y ya no
        // vuelve a evaluar esta condición (zona_neutra_detectada nunca
        // vuelve a false).
        if (!zona_neutra_detectada && phase == Mission::Phase::BUSCAR_ZONA_NEUTRA &&
            last_color.back_valid && last_color.back == ColorLabel::YELLOW) {
            zona_neutra_detectada = true;
            phase = Mission::Phase::DETENER_ZONA_NEUTRA;
            phase_started_ms = millis();
        }

        // --- 1. PRIORIDAD MÁXIMA: no salirse de la pista -------------------
        // Idéntico a decision.py::_evadir_borde: pisa cualquier otra fase...
        // EXCEPTO mientras se asegura la llave, Y EXCEPTO una vez que ya se
        // detectó la zona neutra (ver zona_neutra_detectada arriba): a
        // partir de ahí, parar/retroceder/soltar es una maniobra fija que
        // no debe interrumpirse por una lectura de reflectancia. Sin el
        // freno de ASEGURAR_LLAVE, un umbral de reflectancia sin calibrar
        // (ver kDarkThreshold) podía hacer que el robot arrancara
        // moviéndose para atrás desde el segundo 0, sin que el
        // switch(phase) de más abajo llegara siquiera a mandar CLOSE_LLAVE
        // (evadiendo=true se salta ese switch por completo).
        const bool puede_moverse = (phase != Mission::Phase::ARRANQUE &&
                                     phase != Mission::Phase::ASEGURAR_LLAVE);
        const bool puede_evadir = puede_moverse && !zona_neutra_detectada;
        bool evadiendo = false;
        if (puede_evadir) {
            if (last_reflect.left_on_line && last_reflect.right_on_line) {
                SetDrive(motor, -Mission::kVelocidadAproximacion, -Mission::kVelocidadAproximacion);
                evadiendo = true;
            } else if (last_reflect.left_on_line) {
                SetDrive(motor, -Mission::kVelocidadAproximacion, -Mission::kVelocidadAproximacion / 3);
                evadiendo = true;
            } else if (last_reflect.right_on_line) {
                SetDrive(motor, -Mission::kVelocidadAproximacion / 3, -Mission::kVelocidadAproximacion);
                evadiendo = true;
            }
        }

        // DIAGNÓSTICO TEMPORAL: kDarkThreshold nunca se calibró contra el
        // piso/luz reales (ver el TODO junto a su declaración). Si el robot
        // solo retrocede y el gripper nunca recibe comandos, lo primero a
        // revisar es si "evadiendo" da true todo el tiempo — este log
        // muestra los valores crudos para comparar contra el umbral.
        // Quitar una vez que kDarkThreshold quede calibrado en banco.
        {
            static uint32_t last_reflect_log_ms = 0;
            if ((uint32_t)(millis() - last_reflect_log_ms) > 500) {
                last_reflect_log_ms = millis();
                DEBUG_LINK.printf(
                    "[Reflect] izq=%u der=%u (umbral=%u) on_line: izq=%d der=%d "
                    "-> puede_moverse=%d puede_evadir=%d evadiendo=%d zona_neutra_detectada=%d\n",
                    last_reflect.left_raw, last_reflect.right_raw, kDarkThreshold,
                    last_reflect.left_on_line, last_reflect.right_on_line,
                    puede_moverse, puede_evadir, evadiendo, zona_neutra_detectada);
            }
        }

        // Ayuda a depurar en banco: cambiar de fase se ve en el monitor
        // serial sin tener que instrumentar cada rama.
        if (phase != last_logged_phase) {
            DEBUG_LINK.printf("[Mission] fase -> %s\n", Mission::PhaseName(phase));
            last_logged_phase = phase;
        }

        if (!evadiendo) {
            switch (phase) {

                // -- 2. Cuenta regresiva para cargar la llave a mano --------
                case Mission::Phase::ARRANQUE: {
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kStartupDelayMs) {
                        phase = Mission::Phase::ASEGURAR_LLAVE;
                        phase_started_ms = millis();
                    }
                    break;
                }

                // -- 3. Asegurar la llave que el operador ya colocó ---------
                case Mission::Phase::ASEGURAR_LLAVE: {
                    gripper.action = GripperAction::CLOSE_LLAVE;
                    send_gripper = true;
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kGripperSettleMs) {
                        phase = Mission::Phase::BUSCAR_ZONA_NEUTRA;
                        phase_started_ms = millis();
                    }
                    break;
                }

                // -- 4. Avanzar hasta pisar la zona amarilla ----------------
                // Usa el sensor TRASERO: el delantero se retiró por
                // completo junto con el bus I2C nº0 (ver aviso al
                // principio del archivo). La transición a
                // DETENER_ZONA_NEUTRA ya no se decide aquí: la maneja el
                // cerrojo zona_neutra_detectada, más arriba, ANTES de la
                // evasión de borde -- si se dejara aquí, evadiendo=true
                // podría saltarse este case entero justo el instante en
                // que se detecta el amarillo. Si seguimos viendo esta
                // fase, es que todavía no se detectó: seguir avanzando.
                case Mission::Phase::BUSCAR_ZONA_NEUTRA: {
                    SetDrive(motor, Mission::kVelocidadCrucero, Mission::kVelocidadCrucero);
                    break;
                }

                // -- 4a. Full stop antes de invertir el sentido de marcha ---
                // Pedido explícito: detenerse por completo (motor en STOP,
                // no una frenada a mitad de un SetDrive) antes de
                // retroceder, en vez de pasar directo de avanzar a
                // retroceder. motor se queda en su valor por defecto
                // (STOP): no hace falta llamar a SetDrive aquí.
                case Mission::Phase::DETENER_ZONA_NEUTRA: {
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kFullStopMs) {
                        phase = Mission::Phase::RETROCEDER_A_ZONA_NEUTRA;
                        phase_started_ms = millis();
                    }
                    break;
                }

                // -- 4b. Retroceder para que el FRENTE (no solo el sensor
                // trasero) quede dentro de la zona amarilla --------------
                // El trasero recién detecta el amarillo cuando ya lo pasó
                // de largo -- sin este paso, la llave (al frente) quedaría
                // más allá de la zona segura, no dentro. Tiempo fijo, sin
                // sensor: Mission::kRetrocesoZonaNeutraMs es el único número
                // que hay que ajustar en banco según cuánto se pasa.
                case Mission::Phase::RETROCEDER_A_ZONA_NEUTRA: {
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kRetrocesoZonaNeutraMs) {
                        phase = Mission::Phase::DEPOSITAR_LLAVE;
                        phase_started_ms = millis();
                    } else {
                        SetDrive(motor, -Mission::kVelocidadAproximacion, -Mission::kVelocidadAproximacion);
                    }
                    break;
                }

                // -- 5. Soltar la llave: fin de la misión de esta demo ------
                // (sin bus I2C nº0 no hay forma de buscar la bandera del
                // oponente -- ver el aviso grande al principio del
                // archivo -- así que la secuencia termina aquí).
                case Mission::Phase::DEPOSITAR_LLAVE: {
                    gripper.action = GripperAction::OPEN;
                    send_gripper = true;
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kGripperSettleMs) {
                        phase = Mission::Phase::TERMINADO;
                        phase_started_ms = millis();
                    }
                    break;
                }

                // -- 6. Misión completa: quieto -------------------------------
                case Mission::Phase::TERMINADO:
                default:
                    break;
            }
        }

        } // if (Mission::kMotionEnabled)

        xQueueOverwrite(g_motorCmdQueue, &motor);
        if (send_gripper) xQueueSend(g_gripperCmdQueue, &gripper, 0);

